SilenceLY05/STM32F103Standard/32-TIM—通用定时器/3-TIM—通用定时器输入捕获-测量脉冲宽度/User/GeneralTim/bsp_GeneralTim.h
#ifndef __BSP_GENERALTIM_H
#define __BSP_GENERALTIM_H

#include "stm32f10x.h"

/************通用定时器TIM参数定义，只限TIM2、3、4、5************/
// 当使用不同的定时器的时候，对应的GPIO是不一样的，这点要注意
// 我们这里默认使用TIM3

#define     GENERAL_TIM                       TIM5
#define     GENERAL_TIM_APBxClock_FUN         RCC_APB1PeriphClockCmd
#define     GENERAL_TIM_CLK                   RCC_APB1Periph_TIM5
#define     GENERAL_TIM_PERIOD                0xFFFF
#define     GENERAL_TIM_PSC                   (72-1)

//TIM3输出比较通道1
#define     GENERAL_TIM_CH1_GPIO_CLK          RCC_APB2Periph_GPIOA
#define     GENERAL_TIM_CH1_GPIO_PORT         GPIOA
#define     GENERAL_TIM_CH1_GPIO_PIN          GPIO_Pin_0
#define     GENERAL_TIM_CH1_CHANNNEL_x        TIM_Channel_1

//中断相关宏定义
#define     GENERAL_TIM_IT_CCx                TIM_IT_CC1
#define     GENERAL_TIM_IRQ                   TIM5_IRQn
#define     GENERAL_TIM_INT_FUN               TIM5_IRQHandler

//获取捕获寄存器值函数宏定义
#define     GENERAL_TIM_GetCapturex_FUN       TIM_GetCapture1
//捕获信号极性函数宏定义
#define     GENERAL_TIM_OCxPolarityConfig_FUN TIM_OC1PolarityConfig


//测量的起始边沿
#define     GENERAL_TIM_START_ICPolarity      TIM_ICPolarity_Rising
#define     GENERAL_TIM_END_ICPolarity        TIM_ICPolarity_Falling

//定时器输入捕获用户自定义变量结构体声明
typedef struct 
{
	uint8_t   Capture_FinishFlag;   //捕获结束标志位
	uint8_t   Capture_StartFlag;    //捕获开始标志位
	uint16_t  Capture_CcrValue;     //捕获寄存器的值
	uint16_t  Capture_Period;       //自动重装载寄存器更新标志
}TIM_ICUserValueTypeDef;

extern  TIM_ICUserValueTypeDef      TIM_ICUserValueStructure;



void GENERAL_TIM_Init(void);


#endif /* __BSP_GENERALTIM_H */
